Repository: haibergalindouniandes/MISW-PF-Grupo1-Web
Catalog: src/locale/messages.*.xlf
Languages: es

source: Welcome to SportApp
es: Bienvenido a SportApp

source: Password
es: Contraseña

source: Login
es: Iniciar Sesión

source: Recover Password
es: Recuperar Contraseña

source: Sign Up
es: Registrarse

source: Your health and exercise platform
es: Tu plataforma de salud y ejercicio

source: SportApp helps you:
es: SportApp te ayuda a:

source: Control your physical activity: cycling, running.
es: Controla tu actividad física: ciclismo, correr.

source: Monitor your progress and achieve your health goals.
es: Monitorice su progreso y alcance sus objetivos de salud.

source: Connect with other athletes and share your passion for sports.
es: Conéctate con otros atletas y comparte tu pasión por los deportes.

source: More information
es: Más información

source: Download the app
es: Descargue la APP

source: Name:
es: Nombre:

source: Date:
es: Fecha:

source: Time:
es: Hora:

source: Cost:
es: Costo:

source: Place:
es: Zona:

source: Description:
es: Descripción:

source: Registered user
es: Usuario registrado

# messagePlaceholder
source: Notification message to registered users
es: Mensaje de notificación a usuarios registrados

source: Send notification
es: Enviar notificación

source: Value you entered is {{ notificationForm.controls['message'].errors?.['minlength'].actualLength }} characters, but you must enter ingresar {{ notificationForm.controls['message'].errors?.['minlength'].requiredLength}} characters.
es: El valor ingresado es {{ notificationForm.controls['message'].errors?.['minlength'].actualLength }} carácteres, pero debe ingresar {{ notificationForm.controls['message'].errors?.['minlength'].requiredLength}} carácteres.

source: Message is required!
es: El mensaje es requerido!

source: Register a new Service
es: Registre un nuevo Servicio

source: Service name
es: Nombre del servicio

source: Value you entered is {{ serviceRegistrationForm.controls['name'].errors?.['minlength'].actualLength }} characters, but you must enter {{ serviceRegistrationForm.controls['name'].errors?.['minlength'].requiredLength}} characters.
es: El valor ingresado es {{ serviceRegistrationForm.controls['name'].errors?.['minlength'].actualLength }} carácteres, pero debe ingresar {{ serviceRegistrationForm.controls['name'].errors?.['minlength'].requiredLength}} carácteres.

source: Service name is required!
es: El nombre del servicio es requerido!

source: Service description
es: Descripción del servicio

source: Service description is required!
es: La descripción del servicio es requerida!

source: Cost of service
es: Costo del servicio

source: Cost of service is required!
es: El costo del servicio es requerido!

source: Place
es: Lugar

source: Place is required!
es: El lugar es requerido!

source: Date of service
es: Fecha del servicio

source: Date of service is required!
es: La fecha del servicio es requerida!

source: Minimum number of participants
es: Número mínimo de participanes

source: Minimum number of participants is required!
es: El número mínimo de participanes es requerido!

source: Maximum number of participants
es: Número máximo de participanes

source: Maximum number of participants is required!
es: El número máximo de participanes es requerido!

source: Service frequency
es: Frecuencia del servicio

source: Service frequency is required!
es: La frecuencia del servicio es requerida!

source: Register
es: Registrar

source: Cancel
es: Cancelar

source: My Events/Services
es: Mis Eventos/Servicios

source: Nearby Events
es: Eventos Cercanos

source: Event/Service Detail
es: Detalle del Evento/Servicio

source: © {{ year }} SportApp. All rights reserved.
es: © {{ year }} SportApp. Todos los derechos reservados.

source: Services
es: Servicios

source: Schedule
es: Agendar

source: About
es: Acerca

source: Language <i class="fas fa-globe"></i>
es: Idioma <i class="fas fa-globe"></i>

source: Spanish - ESP
es: Español - ESP

source: English - ENG
es: Ingles - ENG

source: Sign In
es: Iniciar sesión

source: Logout
es: Cerrar sesión

source: Lost in space of Sport APP? Hmm, looks like that page doesn't exist.
es: ¿Perdido en el espacio de la aplicación Sport APP? Hmm, parece que esa página no existe.

source: Go Home
es: Ir al Home

source: SportApp User Registration
es: Registro de Usuario SportApp

source: User
es: Usuario

source: This field is required!
es: Este campo es requerido!

source: This field must have a valid email format
es: Este campo debe tener formato de email valido

source: Password
es: Contraseña

source: This field must be between 8 and 64 characters (no spaces, at least one lowercase, uppercase, digit and one special character)
es: Este campo debe tener entre 8 y 64 caracteres (no espacios, al menos una minuscula, mayuscula, digito y un caracter especial)

source: Name
es: Nombres

source: This field requires between 4 and 30 alphabetic characters
es: Este campo requiere entre 4 y 30 caracteres alfabeticos

source: Weight
es: Peso

source: This field is numeric (use point as decimal separator).
es: Este campo es numerico (usar punto como separador decimal).

source: The minimum value of this field is 40 kilograms
es: El valor minimo de este campo es 40 kilogramos

source: The maximum value of this field is 500 kilograms
es: El valor maximo de este campo es 500 kilogramos

source: Last Name
es: Apellidos

source: Age
es: Edad

source: This field is numeric (integer)
es: Este campo es numerico (entero)

source: The minimum value of this field is 18 years
es: El valor minimo de este campo es 18 años

source: The maximum value of this field is 90 years
es: El valor maximo de este campo es 90 años

source: Document Type
es: Tipo de Documento

source: Height
es: Altura

source: The minimum value of this field is 130 centimeters
es: El valor minimo de este campo es 130 centimetros

source: The maximum value of this field is 230 centimeters
es: El valor maximo de este campo es 230 centimetros

source: Document Number
es: Numero de Documento

source: This field must have minimum 8 and maximum 16 numeric characters
es: Este campo debe tener mínimo 8 y máximo 16 caracteres numéricos

source: Country of Birth
es: Pais de Nacimiento

source: City of Birth
es: Ciudad de Nacimiento

source: Gender
es: Genero

source: Country of Residence
es: Pais de Residencia

source: City of Residence
es: Ciudad de Residencia

source: Sports
es: Deportes

source: Cycling
es: Ciclismo

source: Athletics
es: Atletismo

source: Others
es: Otros

source: Seniority
es: Antiguedad

source: The minimum value of this field is 1 month
es: El valor minimo de este campo es 1 mes

source: The maximum value of this field is 900 months
es: El valor maximo de este campo es 900 meses

source: Plan Type
es: Tipo de Plan

source: Type of User
es: Tipo de Usuario

source: Emergency Contacts
es: Contactos de Emergencia

source: Save
es: Guardar
